{"contents":[{"text":"<h2 dir=\"rtl\">تنظیمات محلی</h2>\n<p dir=\"rtl\">در این قسمت می توانید تنظیمات محلی اپلیکیشن خود را انجام دهید. این تنظیمات عبارت اند از:</p>\n<h3 dir=\"rtl\">1- زبان</h3>\n<p dir=\"rtl\">از بین گزینه های ممکن می توانید یک مورد را به عنوان زبان اپلیکیشن خود انتخاب کنید. لازم به ذکر است این امکان وجود دارد که زبان هایی را نیز به گزینه های موجود اضافه کنید. چگونگی انجام این کار در ادامه خواهد آمد.</p>\n<h3 dir=\"rtl\">افزودن یک زبان جدید به برنامه</h3>\n<p dir=\"rtl\">تصور کنید می خواهید زبان عربی یا هر زبان دیگری را به اپلیکیشن خود اضافه کنید. برای این کار باید برخی واژه ها را معادل سازی یا اصلاحاً ترجمه نمایید. اگر بر روی علامت تنظیمات (یا چرخ دنده) در جلوی گزینه ی \"زبان\" یا \"language\" کلیک کنید صفحه ای باز خواهد شد که به شما امکان افزودن یک زبان را خواهد داد. در صفحه ی باز شده بر روی علامت \"+\" کلیک کنید. دیالوگی باز خواهد شد و از شما نام (title) و کلید (key) جدیدی را برای زبان مورد نظرتان خواهد خواست. به عنوان مثال برای افزودن زبان انگلیسی، نام می تواند \"English\" و کلید می تواند \"en\"&nbsp; باشد. (برای عربی نیز \"Arabic\" و \"ar\" می توانند گزینه های مناسبی باشند).&nbsp;</p>\n<p dir=\"rtl\">هنگامی که نام و کلید را انتخاب نمودید بر روی کلید ok در دیالوگ کلیک کنید. در این هنگام یک زبان با نام فوق به لیست زبان ها اضافه می شود.&nbsp;</p>\n<p dir=\"rtl\">در مرحله ی بعد، بر روی زبان ایجاد شده کلیک کنید. صفحه ای باز خواهد شد که در بالای آن نام و کلید انتخاب شده توسط شما نشان داده شده است و در قسمت پایین آن، لیست کلماتی قابل مشاهده است که باید توسط شما ترجمه شوند. بر روی هر کلمه کلیک کرده ابتدا آن را پاک کنید و معادل آن کلمه در زبان جدید را تایپ کنید. به عنوان مثال اولین کلمه از لیست کلمات عبارت است از: \"loading configuration\". آن را پاک کنید و معادل آن را در زبان جدید وارد کنید. این کار را برای تمامی کلمات انجام دهید.&nbsp;</p>\n<p dir=\"rtl\">در پایان کلید \"ذخیره\" یا \"save\" را کلیک کنید تا زبان شما به صورت کامل به لیست زبان های قابل انتخاب در صفحه ی قبل اضافه شود.</p>\n<p dir=\"rtl\">&nbsp;</p>\n<h3 dir=\"rtl\">2- جهت صفحه یا direction</h3>\n<p dir=\"rtl\">جهت صفحه می تواند چپ به راست یا برعکس انتخاب شود.</p>\n<h3 dir=\"rtl\">3- تقویم یا calendar</h3>\n<p dir=\"rtl\">از بین تقویم های نشان داده شده یک مورد را انتخاب کنید. این تقویم ها عبارتنداز: خورشیدی (Jalaali)، میلادی (Gregorian) و ... . تاریخ ها در سایت یا اپلیکیشن شما بر اساس این تقویم انتخابی نشان داده خواهند شد.</p>\n<h3 dir=\"rtl\">4- فرمت نشان دادن تاریخ یا Date format</h3>\n<p dir=\"rtl\">از بین حالات مختلف بر اساس نیاز خود یک مورد را انتخاب کنید. تاریخ ها بر اساس آن نشان داده خواهند شد.</p>","type":"HtmlText","name":"HTML text","style":{"borderColor":{"bottom":"none"},"margin":{},"borderRadius":{},"borderStyleColorWidth":{},"borderStyle":{},"borderWidth":{},"flexAlignItem":"wb-flex-item-auto"}}],"type":"Page","direction":"rtl"}